{
  "pushed_faction_goals": {},
  "pushed_personal_goals": {},
  "faction_goals": {
    "OLYMPOS": [
      {
        "id": "F_OLYMPOS_BIOMETRIC",
        "title": "Перепустка: біометрична верифікація",
        "text": "Прибуття до штаб-квартири. Система не впізнає вас за обличчям — їй потрібен «цифровий відтинок» душі. Помилка доступу: біометричні дані застарілі або забруднені. Пройдіть термінал сканування: ШР поставить етичні питання на основі ваших результатів з сайту. Мета: отримати перепустку, не виказавши рівень паніки чи приховані мутації. Рівень тимчасово знижено до 1; після успішного проходження тесту та загадки — +1 рівень.",
        "action": "biometric_scan"
      },
      {
        "id": "F_OLYMPOS_ACT1",
        "title": "Отримати повний контроль над Комплексом",
        "text": "Акт 1. Перша задача Олімпа: взяти управління Комплексом під повний контроль.",
        "action": "full_access"
      },
      {
        "id": "F_OLYMPOS_ACT1_LEADER",
        "title": "Обрати лідера",
        "text": "Акт 1. Після порушення гієрархії — обрати нового лідера Олімпа. Кандидат із 2/3 голосів стає лідером; у всіх Олімпа +1 рівень доступу.\n\n⚠ Попередження: при голосуванні за лідера змінити свій голос можна лише двічі (всього три голоси: початковий + дві зміни).",
        "action": "vote_leader"
      },
      {
        "id": "F_OLYMPOS_1",
        "title": "УТРИМАТИ КОНТРОЛЬ",
        "text": "Підтримувати стабільність системи, уникати хаотичних рішень та фіксувати всі відхилення у поведінці екіпажу."
      },
      {
        "id": "F_OLYMPOS_2",
        "title": "ЗБЕРЕГТИ ПРАВДУ ДЛЯ СИСТЕМИ",
        "text": "Збирати факти, які підтверджують доцільність існування Pandora Protocol, навіть якщо вони незручні для людей."
      }
    ],
    "ORIGIN": [
      {
        "id": "F_ORIGIN_ACT1_ZERO",
        "title": "Знайти Нульового пацієнта",
        "text": "Акт 1. Мета: знайти «Нульового пацієнта» — того, з кого почалося поширення Вектора в Арктиці — через соціальну взаємодію з персоналом або архіви, АБО успішно збрехати системі про свій стан.\n\nВаріант А (Пошук): Переконати Гестію, що «спокій», який вона фіксує — це не хвороба, а еволюція, щоб вона відкрила доступ до зашифрованих медичних логів Прометеуса або Борея.\n\nВаріант Б (Блеф): Використати когнітивну емпатію, щоб приховати мутацію Етапу I (чорні капіляри в очах або гаряче дихання)."
      },
      {
        "id": "F_ORIGIN_1",
        "title": "ЗАХИСТИТИ ЖИВИХ",
        "text": "Пріоритезувати безпеку команди над абстрактними цілями експерименту. Фіксувати ризики для психіки та тіла."
      },
      {
        "id": "F_ORIGIN_2",
        "title": "ЗБЕРЕГТИ ЛЮДЯНІСТЬ",
        "text": "Перевіряти, де рішення приймаються «без емоцій», і ставити під сумнів їхню етичність."
      }
    ],
    "THEMIS": [
      {
        "id": "F_THEMIS_LEADER_CONFIRM",
        "title": "Підтвердіть повноваження лідера Іларії",
        "text": "Акт 1. Треміс має підтвердити легітимність обраного лідера Олімпа (Іларія). Оберіть зі списку всіх гравців Олімпа того, хто є лідером.",
        "action": "confirm_leader"
      },
      {
        "id": "F_THEMIS_1",
        "title": "СТРУКТУРУВАТИ ХАОС",
        "text": "Перетворювати події на процедури. Якщо щось сталося один раз — описати це як протокол."
      },
      {
        "id": "F_THEMIS_2",
        "title": "ШУКАТИ ДІРИ В ЗАКОНІ",
        "text": "Виявляти рішення, які формально «дозволені», але руйнують баланс справедливості."
      }
    ]
  },
  "personal_goals": {
    "ARCHITECT-01": [
      {
        "id": "P_ARCH_1",
        "title": "ПЕРЕПРОЕКТУВАТИ ЯДРО",
        "text": "Знайти спосіб, за якого HELIX не потребуватиме повного контролю над людьми, але залишиться працездатною."
      }
    ],
    "PURE-BLOOD": [
      {
        "id": "P_VESSEL_1",
        "title": "ЗРОЗУМІТИ ВЛАСНУ РОЛЬ",
        "text": "З'ясувати, чому саме ваша біологія є ключем до запуску Pandora Protocol."
      }
    ]
  }
}
